whiteb3ar/hoverboard-firmware-hack-FOC/Src/Board/Gd32F130C8T6/board.c
#include "defines_Gd32F130C8T6.h"
//#include "defines.h"
#include "it.h"
#include "board.h"
#include "comms.h"
#include "app.h"
#include "buzzer.h"
#include "config.h"
#include <string.h>

//----------------------------------------------------------------------------
// Send buffer via USART
//----------------------------------------------------------------------------
void SendBuffer(uint32_t usart_periph, uint8_t buffer[], uint8_t length)
{
	uint8_t index = 0;
	
	for(; index < length; index++)
	{
        usart_data_transmit(usart_periph, buffer[index]);

        while (usart_flag_get(usart_periph, USART_FLAG_TBE) == RESET)
		{
        }
	}
}

#ifndef pinMode
void pinMode(uint32_t pin, uint32_t mode)
{
	gpio_mode_set(pin&0xffffff00U, mode, GPIO_PUPD_NONE,BIT(pin&0xfU) );
	gpio_output_options_set(pin&0xffffff00U, GPIO_OTYPE_PP, GPIO_OSPEED_10MHZ, BIT(pin&0xfU));
}

void pinModePull(uint32_t pin, uint32_t mode, uint32_t pull)
{
	gpio_mode_set(pin&0xffffff00U, mode, pull,BIT(pin&0xfU) );
	gpio_output_options_set(pin&0xffffff00U, GPIO_OTYPE_PP, GPIO_OSPEED_10MHZ, BIT(pin&0xfU));
}
#endif

#define TIMEOUT_FREQ  1000

// timeout timer parameter structs
timer_parameter_struct timeoutTimer_paramter_struct;

// PWM timer Parameter structs
timer_parameter_struct timerBldc_paramter_struct;	
timer_break_parameter_struct timerBldc_break_parameter_struct;
timer_oc_parameter_struct timerBldc_oc_parameter_struct;

// DMA (USART) structs
dma_parameter_struct dma_init_struct_usart;

//uint8_t usartMasterSlave_rx_buf[USART_MASTERSLAVE_RX_BUFFERSIZE];
//uint8_t usartSteer_COM_rx_buf[USART_STEER_COM_RX_BUFFERSIZE];

#define ARRAY_LEN(x) (uint32_t)(sizeof(x) / sizeof(*(x)))

uint8_t usart0_rx_buf[1];
uint8_t usart1_rx_buf[SERIAL_BUFFER_SIZE]; // USART Rx DMA circular buffer
uint32_t usart1_rx_buf_len = ARRAY_LEN(usart1_rx_buf);

// DMA (ADC) structs
dma_parameter_struct dma_init_struct_adc;
extern adc_buf_t adc_buffer;

//----------------------------------------------------------------------------
// Initializes the interrupts
//----------------------------------------------------------------------------
void Interrupt_init(void)
{
  // Set IRQ priority configuration
	TARGET_nvic_priority_group_set(NVIC_PRIGROUP_PRE4_SUB0);
}

//----------------------------------------------------------------------------
// Initializes the watchdog
//----------------------------------------------------------------------------
ErrStatus Watchdog_init(void)
{
	return SUCCESS;
	// Check if the system has resumed from FWDGT reset
	if (RESET != rcu_flag_get(RCU_FLAG_FWDGTRST))
	{   
		// FWDGTRST flag set
		rcu_all_reset_flag_clear();
	}
	
	// Clock source is IRC40K (40 kHz)
	// Prescaler is 16
	// Reload value is 4096 (0x0FFF)
	// Watchdog fires after 1638.4 ms
	if (fwdgt_config(0x0FFF, FWDGT_PSC_DIV16) != SUCCESS ||
		fwdgt_window_value_config(0x0FFF) != SUCCESS)
	{
		return ERROR;
	}

	// Enable free watchdog timer
	fwdgt_enable();
	
	return SUCCESS;
}

//----------------------------------------------------------------------------
// Initializes the timeout timer
//----------------------------------------------------------------------------
void TimeoutTimer_init(void)
{
	// Enable timer clock
	rcu_periph_clock_enable(RCU_TIMER_TIMEOUT);
	
	// Initial deinitialize of the timer
	
	timer_deinit(TIMER_TIMEOUT);
	
	// Set up the basic parameter struct for the timer
	// Update event will be fired every 1ms
	timeoutTimer_paramter_struct.counterdirection 	= TIMER_COUNTER_UP;
	timeoutTimer_paramter_struct.prescaler 			= 0;
	timeoutTimer_paramter_struct.alignedmode 		= TIMER_COUNTER_CENTER_DOWN;
	timeoutTimer_paramter_struct.period				= 72000000 / 2 / TIMEOUT_FREQ;
	timeoutTimer_paramter_struct.clockdivision 		= TIMER_CKDIV_DIV1;
	timeoutTimer_paramter_struct.repetitioncounter 	= 0;
	timer_auto_reload_shadow_disable(TIMER_TIMEOUT);
	timer_init(TIMER_TIMEOUT, &timeoutTimer_paramter_struct);
	
	// Enable TIMER_INT_UP interrupt and set priority
	TARGET_nvic_irq_enable(TIMER_TIMEOUT_IRQn, 0, 0);
	timer_interrupt_enable(TIMER_TIMEOUT, TIMER_INT_UP);
	
	// Enable timer
	timer_enable(TIMER_TIMEOUT);
}

//----------------------------------------------------------------------------
// Initializes the GPIOs
//----------------------------------------------------------------------------
void GPIO_init(void)
{
	// Enable all GPIO clocks
	rcu_periph_clock_enable(RCU_GPIOA);
	rcu_periph_clock_enable(RCU_GPIOB);
	rcu_periph_clock_enable(RCU_GPIOC);
	rcu_periph_clock_enable(RCU_GPIOF);
	
	#ifdef TIMER_BLDC_EMERGENCY_SHUTDOWN
		// Init emergency shutdown pin
		pinModeAF(TIMER_BLDC_EMERGENCY_SHUTDOWN,AF_TIMER0_BRKIN,GPIO_PUPD_NONE,GPIO_OSPEED_50MHZ)
	#endif
	
	// Init PWM output Pins
	// Configure: Alternate functions,  [Floating mode] / Pull-up / Pull-down
	// Configure: Push-Pull mode, Output max speed 2MHz
	pinModeAF(BLDC_GH, AF_TIMER0_BLDC, TIMER_BLDC_PULLUP, GPIO_OSPEED_2MHZ);
	pinModeAF(BLDC_GL, AF_TIMER0_BLDC, TIMER_BLDC_PULLUP, GPIO_OSPEED_2MHZ);
	pinModeAF(BLDC_BH, AF_TIMER0_BLDC, TIMER_BLDC_PULLUP, GPIO_OSPEED_2MHZ);
	pinModeAF(BLDC_BL, AF_TIMER0_BLDC, TIMER_BLDC_PULLUP, GPIO_OSPEED_2MHZ);
	pinModeAF(BLDC_YH, AF_TIMER0_BLDC, TIMER_BLDC_PULLUP, GPIO_OSPEED_2MHZ);
	pinModeAF(BLDC_YL, AF_TIMER0_BLDC, TIMER_BLDC_PULLUP, GPIO_OSPEED_2MHZ);

	#ifdef DEBUG_LED_PIN
		gpio_mode_set(DEBUG_LED_PORT , GPIO_MODE_OUTPUT, GPIO_PUPD_NONE,DEBUG_LED_PIN);	
		gpio_output_options_set(DEBUG_LED_PORT, GPIO_OTYPE_PP, GPIO_OSPEED_10MHZ, DEBUG_LED_PIN);
	#endif


	#ifdef LED_GREEN
		pinMode(LED_GREEN,	GPIO_MODE_OUTPUT);
	#endif
	#ifdef LED_RED
		pinMode(LED_RED,		GPIO_MODE_OUTPUT);
	#endif
	#ifdef LED_ORANGE
		pinMode(LED_ORANGE,	GPIO_MODE_OUTPUT);
	#endif
	#ifdef UPPER_LED
		pinMode(UPPER_LED,	GPIO_MODE_OUTPUT);
	#endif
	#ifdef LOWER_LED
		pinMode(LOWER_LED,	GPIO_MODE_OUTPUT);
	#endif
	#ifdef MOSFET_OUT
		pinMode(MOSFET_OUT,	GPIO_MODE_OUTPUT);
	#endif


	#ifdef DEBUG_LED_PIN
		gpio_mode_set(DEBUG_LED_PORT , GPIO_MODE_OUTPUT, GPIO_PUPD_NONE,DEBUG_LED_PIN);	
		gpio_output_options_set(DEBUG_LED_PORT, GPIO_OTYPE_PP, GPIO_OSPEED_10MHZ, DEBUG_LED_PIN);
	#endif


	// Init HAL input
	pinMode(HALL_A,	GPIO_MODE_INPUT);
	pinMode(HALL_B,	GPIO_MODE_INPUT);
	pinMode(HALL_C,	GPIO_MODE_INPUT);

	// Init ADC pins
	#ifdef VBATT
		pinMode(VBATT, GPIO_MODE_ANALOG);
	#endif
	#ifdef CURRENT_DC
		pinMode(CURRENT_DC, GPIO_MODE_ANALOG);
	#endif
	
	// Init self hold
	#ifdef SELF_HOLD
		pinMode(SELF_HOLD,	GPIO_MODE_OUTPUT);
	#endif

	#ifdef BUZZER
		// Init buzzer
		pinModeSpeed(BUZZER,	GPIO_MODE_OUTPUT,GPIO_OSPEED_50MHZ);
		//gpio_mode_set(BUZZER_PORT , GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, BUZZER_PIN);	
		//gpio_output_options_set(BUZZER_PORT, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, BUZZER_PIN);
	#endif

	#ifdef MASTER_OR_SINGLE
	
		// Init button
		#ifdef BUTTON_PU
			pinModePull(BUTTON_PU,GPIO_MODE_INPUT,GPIO_PUPD_PULLUP);
		#else
			pinMode(BUTTON,	GPIO_MODE_INPUT);
		#endif
		
		#ifdef CHARGE_STATE_PIN
			// Init charge state
			pinModePull(CHARGE_STATE,GPIO_MODE_INPUT, GPIO_PUPD_PULLUP);
			//gpio_mode_set(CHARGE_STATE_PORT, GPIO_MODE_INPUT, GPIO_PUPD_PULLUP, CHARGE_STATE_PIN);
		#endif
	#endif

