whiteb3ar/hoverboard-firmware-hack-FOC/Src/Board/Gd32F130C8T6/board.c
	// USART DMA enable for transmission and receive
	usart_dma_receive_config(USART0, USART_DENR_ENABLE);
	
	// Enable DMA transfer complete interrupt
	dma_interrupt_enable(DMA_CH2, DMA_CHXCTL_FTFIE);
	
	// At least clear number of remaining data to be transferred by the DMA 
	dma_transfer_number_config(DMA_CH2, 1);
	
	// Enable dma receive channel
	dma_channel_enable(DMA_CH2);
	
#endif
}

/*
//----------------------------------------------------------------------------
// Initializes the usart steer/bluetooth
//----------------------------------------------------------------------------
void USART_Steer_COM_init(void)
{
#ifdef USART_STEER_COM_BAUD
	
		// Enable ADC and DMA clock
	rcu_periph_clock_enable(USART_STEER_RCU);
	rcu_periph_clock_enable(RCU_DMA);
	
	// Init USART for 19200 baud, 8N1
	usart_baudrate_set(USART_STEER_COM, USART_STEER_COM_BAUD);
	usart_parity_config(USART_STEER_COM, USART_PM_NONE);
	usart_word_length_set(USART_STEER_COM, USART_WL_8BIT);
	usart_stop_bit_set(USART_STEER_COM, USART_STB_1BIT);
	usart_oversample_config(USART_STEER_COM, USART_OVSMOD_16);
	
	
	// Enable both transmitter and receiver
	usart_transmit_config(USART_STEER_COM, USART_TRANSMIT_ENABLE);
	//usart_invert_config(USART_STEER_COM, USART_SWAP_ENABLE);	// HarleyBob
	usart_receive_config(USART_STEER_COM, USART_RECEIVE_ENABLE);
	
	// Enable USART
	usart_enable(USART_STEER_COM);
	
	// Interrupt channel 1/2 enable
	TARGET_nvic_irq_enable(DMA_Channel1_2_IRQn, 2, 0);
	
	// Initialize DMA channel 2 for USART_STEER_COM RX
	dma_deinit(DMA_CH2);
	dma_init_struct_usart.direction = DMA_PERIPHERAL_TO_MEMORY;
	dma_init_struct_usart.memory_addr = (uint32_t)usartSteer_COM_rx_buf;
	dma_init_struct_usart.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
	dma_init_struct_usart.memory_width = DMA_MEMORY_WIDTH_8BIT;
	dma_init_struct_usart.number = USART_STEER_COM_RX_BUFFERSIZE;
	dma_init_struct_usart.periph_addr = USART_STEER_COM_DATA_RX_ADDRESS;
	dma_init_struct_usart.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
	dma_init_struct_usart.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
	dma_init_struct_usart.priority = DMA_PRIORITY_ULTRA_HIGH;
	dma_init(DMA_CH2, &dma_init_struct_usart);
	
	// Configure DMA mode
	dma_circulation_enable(DMA_CH2);
	dma_memory_to_memory_disable(DMA_CH2);

	// USART DMA enable for transmission and receive
	usart_dma_receive_config(USART_STEER_COM, USART_DENR_ENABLE);
	
	// Enable DMA transfer complete interrupt
	dma_interrupt_enable(DMA_CH2, DMA_CHXCTL_FTFIE);
	
	// At least clear number of remaining data to be transferred by the DMA 
	dma_transfer_number_config(DMA_CH2, 1);
	
	// Enable dma receive channel
	dma_channel_enable(DMA_CH2);
#endif
}
*/

void reset(void)
{
	#ifdef USART_MASTERSLAVE
		usart_deinit(USART_MASTERSLAVE);
	#endif
	
	#ifdef SELF_HOLD
		digitalWrite(SELF_HOLD, RESET);
	#endif

	while(1)
	{
		// Reload watchdog until device is off
		fwdgt_counter_reload();
	}
}

void hardware_init(void) {
	// SystemClock_Config();
	SystemCoreClockUpdate();

	// Configure SysTick to generate an interrupt every millisecond
	SysTick_Config(SystemCoreClock / 1000);

	// Init watchdog
	if (Watchdog_init() == ERROR)
	{
		while(1)
		{
			//error
		}
	}

	Interrupt_init();
	TimeoutTimer_init();
	GPIO_init();

	#ifdef USART0_BAUD
		USART0_Init(USART0_BAUD);
	#endif
	#ifdef USART1_BAUD
		USART1_Init(USART1_BAUD);
	#endif

	ADC_init();
	PWM_init();
	
	// Device has 1,6 seconds to do all the initialization
	// afterwards watchdog will be fired
	fwdgt_counter_reload();
}

void activate_latch(void) {
	#ifdef SELF_HOLD
		// Activate self hold direct after GPIO-init
		digitalWrite(SELF_HOLD, SET);
	#endif
}

void reset_watchog(void)
{
	fwdgt_counter_reload();
}

int is_button_pressed(void) {
	return digitalRead(BUTTON);
}

void light_led()
{
	digitalWrite(UPPER_LED, SET);
}

void start_adc()
{
	//do nothing already started?
}

int is_uart3_available(void) {
	FlagStatus status = usart_flag_get(USART1, USART_FLAG_TC);

	return SET == status;
}

void uart3_transmit(uint8_t *data, int size)
{
	SendBuffer(USART1, data, size);
}

uint8_t non_dma_rx[SERIAL_BUFFER_SIZE] = { 'a', 'b', 'c', 'a', 'v' };

volatile uint32_t received_length = 0;
volatile uint32_t old_position = 0;
volatile uint32_t current_buffer_position = 0;
volatile uint32_t dma_count = 0;
volatile uint32_t test_counter = 0;
volatile uint8_t data_received = 0;

void process_usart_rx(uint32_t dma_remaining_count) {
	data_received = true;

	test_counter++;

	dma_count = dma_remaining_count;
	received_length = 0;
	current_buffer_position = usart1_rx_buf_len - dma_remaining_count;

	// if (current_buffer_position != old_position)
	// {
	// 	if (current_buffer_position > old_position)
	// 	{
	// 		received_length = current_buffer_position - old_position;
	// 		memcpy(non_dma_rx, &usart1_rx_buf[old_position], received_length);
	// 	}
	// 	else if ((usart1_rx_buf_len - old_position + current_buffer_position) > 0)
	// 	{
	// 		uint32_t head_length = current_buffer_position;
	// 		uint32_t tail_length = usart1_rx_buf_len - old_position;

	// 		memcpy(non_dma_rx, &usart1_rx_buf[old_position], tail_length);

	// 		if (head_length > 0)
	// 		{
	// 			memcpy(&non_dma_rx[usart1_rx_buf_len - old_position], &usart1_rx_buf[0], head_length);
	// 		}

	// 		received_length = head_length + tail_length;
	// 	}
	// }

	// memcpy(non_dma_rx, usart1_rx_buf, SERIAL_BUFFER_SIZE);

	old_position = current_buffer_position; // Update old position
	if (old_position == usart1_rx_buf_len)
	{
		old_position = 0;
	}

	//usart3_rx_check(current_buffer_position);
}

void USARTx_IRQHandler(uint32_t handle) {
	if (handle == USART0) {

	} else if (handle == USART1) {

	}
}

void board_usart0_rx_check() {
	dma_transfer_number_get(DMA_CH2);
}

void board_usart1_rx_check() {
	dma_transfer_number_get(DMA_CH4);
}

void init_eeprom(void)
{
	//TOOD:
}

void read_configuration_value(uint16_t address, uint16_t *value)
{
	//TODO:
}

void read_configuration(uint16_t *configuration)
{
	//TOOD:
}

FlagStatus buzzerToggle = RESET;

void toggle_buzzer(void)
{
	buzzerToggle = buzzerToggle == RESET ? SET : RESET;

	//digitalWrite(BUZZER, buzzerToggle);
}

void switch_buzzer_off(void)
{
	//digitalWrite(BUZZER, RESET);
}


Hardware hardware = {
    .activate_latch = activate_latch,
    .hardware_init = hardware_init,
    .is_button_pressed = is_button_pressed,
    .light_led = light_led,
    .start_adc = start_adc,

	.toggle_buzzer = toggle_buzzer,
	.switch_buzzer_off = switch_buzzer_off,

    .is_uart3_available = is_uart3_available,
    .uart3_transmit = uart3_transmit,
    .unit_uart2_dma = unit_uart2_dma,
    .unit_uart3_dma = unit_uart3_dma,

    .init_eeprom = init_eeprom,
    .read_configuration = read_configuration,
    .read_configuration_value = read_configuration_value,

	.reset_watchdog = reset_watchog,
    .reset = reset
};
